#include <iostream>
#include "string.h"
using namespace std;

int main() {
    // 1. -----------------------------
    int A[10];
    // 2. -----------------------------
    int B[10] = {1,2,3,4,5,6,7,8,9,10};
    // -------------- OR --------------
    int C[10];
    for (int i=1; i<10; i++) {
        C[i] = i+1;
    }
    // 3. -----------------------------
    int D[10];
    D[0] = 20;
    // 4. -----------------------------
    // 顯示陣列內容
    int E[10] = {1,2,3,4,5,6,7,8,9,10};
    for (int i=1; i<10; i++) {
        cout << E[i] << endl;
        // ------- OR -------
        cout << E[i] << "\n";
        // ------- OR -------
        cout << E[i] << ", ";
    }
    // 5. -----------------------------
    // 下列指令群執行後，字串內容如何?
    char str1[20] = "Test";
    // 6. -----------------------------
    // 將字串 "Line2" 串接到字串 str2 的後面
    char str2[20] = "Test";
    strcat(str2, "Line2");
    // 6. -----------------------------
    char str3[20];
    strcpy(str2, str1);
    // END OF FILE
    return 0;
}
